# Heroes of Pymoli: In-Game Purchase Insights

## Trends

Three observable trends based on the data

## Analysis

In [1]:
# Dependencies
import pandas as pd

In [2]:
# Load csv file
purchases_csv = "Resources/purchase_data.csv"

# Read csv and store in DataFrame
purchases_df = pd.read_csv(purchases_csv)
purchases_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchases_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
purchases_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

## Player count

Total number of players = 576

In [5]:
# Number of unique player names in SN column = total number of players
total_unique_players = purchases_df["SN"].nunique()
total_unique_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.
* Create a summary data frame to hold the results
* Optional: give the displayed data cleaner formatting
* Display the summary data frame

In [6]:
# Unique values in Item ID column provides number of unique items purchased

unique_items = purchases_df["Item ID"].nunique()
unique_items

179

In [7]:
# Mean of price column = average price
average_price = purchases_df["Price"].mean()
average_price

3.050987179487176

In [8]:
# Count of purchase ID = total number of purchases
total_purchases = purchases_df["Purchase ID"].count()
total_purchases

780

In [9]:
# Sum of price column = total revenue
total_revenue = purchases_df["Price"].sum()
total_revenue

2379.77

In [10]:
# Create a DataFrame of summary data
summary_df = pd.DataFrame({"Total unique players": [total_unique_players],"Unique items": [unique_items],
                           "Average price": [average_price],
                           "Total purchases": [total_purchases],
                          "Total revenue": [total_revenue]}).round(2)

#Print summary Data Frame
summary_df

,Total unique players,Unique items,Average price,Total purchases,Total revenue
0,576,179,3.05,780,2379.77

# Gender Demographics

* Percentage and Count of Male Players<br>
* Percentage and Count of Female Players<br>
* Percentage and Count of Other / Non-Disclosed

In [11]:
# Pivot table to obtain data grouped by players and genders
gender_grouped_df = pd.pivot_table(data=purchases_df,index=['SN','Gender'])
gender_grouped_df = gender_grouped_df.reset_index()
gender_grouped_df

                SN  Gender  Age     Item ID     Price  Purchase ID
0     Adairialis76    Male   16  123.000000  2.280000   467.000000
1      Adastirin33  Female   35  175.000000  4.480000   142.000000
2           Aeda94    Male   17  128.000000  4.910000   388.000000
3           Aela59    Male   21  119.000000  4.320000    28.000000
4        Aelaria33    Male   23  171.000000  1.790000   630.000000
..             ...     ...  ...         ...       ...          ...
571     Yathecal82  Female   20   80.333333  2.073333   466.666667
572     Yathedeu43    Male   22   71.500000  3.010000   344.000000
573  Yoishirrala98  Female   17  145.000000  4.580000   572.000000
574     Zhisrisu83    Male   10   42.500000  3.945000    97.500000
575      Zontibe81    Male   21   82.333333  2.676667   339.666667

[576 rows x 6 columns]

In [12]:
# Calculate and store gender counts
gender_counts = gender_grouped_df["Gender"].value_counts()
gender_counts

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [13]:
# Calculate and store gender percentages
gender_percentage = gender_grouped_df["Gender"].value_counts(normalize=True)
gender_percentage

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [14]:
# Create a new Data Frame containing gender counts and percentages
gender_demo_df = pd.DataFrame({"Total count": gender_counts,"Percentage of players": gender_percentage}).round(2)
# Print the gender demographics Data Frame
gender_demo_df

                       Total count  Percentage of players
Male                           484                   0.84
Female                          81                   0.14
Other / Non-Disclosed           11                   0.02

## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
# purchase_count = purchases_df.groupby(["Gender"])["Price"].count()
# purchase_count

In [16]:
# average_purchase_price = purchases_df.groupby(["Gender"])["Price"].mean()
# average_purchase_price

In [17]:
# total_purchase_value = purchases_df.groupby(["Gender"])["Price"].sum()
# total_purchase_value

In [18]:
# Instead of separate calculations for each variable, use aggregation function to find purchase count, average purchase price and total purchase volume
purchasing_analysis_gender_agg = purchases_df.groupby(["Gender"]).agg({"Price": ["count", "mean",sum]})
# Rename columns
purchasing_analysis_gender_agg.columns=["Purchase Count","Average Purchase Price","Total Purchase Value"]
# purchasing_analysis_gender_agg

In [19]:
# Add a new column to the Data Frame for average total purchase per person i.e. total purchase value/purchase count
# average_purchase_pp = purchasing_analysis_gender_agg["Total Purchase Value"]/purchasing_analysis_gender_agg["Purchase Count"]
# average_purchase_pp
average_purchase_pp = purchasing_analysis_gender_agg["Total Purchase Value"]/gender_counts
purchasing_analysis_gender_agg["Avg Total Purchase per Person"] = average_purchase_pp

# Print the purchasing analysis (gender) Data Frame
purchasing_analysis_gender_agg.round(2)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [20]:
# Create a new Data Frame with grouped by name, age and gender aggregated by price (sum and count (of purchases)) 
purchases_grouped_df = purchases_df.groupby(["SN","Age"]).agg({"Price": ["count",sum]})
# Rename columns
purchases_grouped_df.rename(columns={"count":"Purchase Count","sum":"Total Purchase Value"})
# Reset index to retrieve grouped columns
purchases_grouped_df = purchases_grouped_df.reset_index()
# Print Data Frame
purchases_grouped_df

                SN Age Price
                       count   sum
0     Adairialis76  16     1  2.28
1      Adastirin33  35     1  4.48
2           Aeda94  17     1  4.91
3           Aela59  21     1  4.32
4        Aelaria33  23     1  1.79
..             ...  ..   ...   ...
571     Yathecal82  20     3  6.22
572     Yathedeu43  22     2  6.02
573  Yoishirrala98  17     1  4.58
574     Zhisrisu83  10     2  7.89
575      Zontibe81  21     3  8.03

[576 rows x 4 columns]

In [21]:
# Create bins based on age ranges
bins = [1, 10, 15, 20, 25, 30, 35, 40, 100]
# Name the bins
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [22]:
# Identify the correct bin (i.e. age range) for each player
pd.cut(purchases_grouped_df["Age"], bins, labels=age_groups)

0      15-19
1      30-34
2      15-19
3      20-24
4      20-24
       ...
571    15-19
572    20-24
573    15-19
574      <10
575    20-24
Name: Age, Length: 576, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [23]:
## I tried adding the sliced data directly to the Data Frame, but I kept getting an issue with the column names appearing in brackets with commas (see purchases_grouped_df.info()).
## As an alternative, I created a new Data Frame and added it to the original one, but it didn't have any effect on the column names.

age_range_df = pd.DataFrame(pd.cut(purchases_grouped_df["Age"], bins, labels=age_groups))
# Rename columns
age_range_df.rename(columns={"Age":"Age Range"}, inplace=True)
# Print age range data frame
age_range_df

    Age Range
0       15-19
1       30-34
2       15-19
3       20-24
4       20-24
..        ...
571     15-19
572     20-24
573     15-19
574       <10
575     20-24

[576 rows x 1 columns]

In [24]:
# Place the age ranges into the DataFrame
purchases_grouped_df["Age Range"] = age_range_df

## I can't work out why the column names are in brackets with commas...? 
purchases_grouped_df.info()
purchases_grouped_df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   (SN, )          576 non-null    object
 1   (Age, )         576 non-null    int64
 2   (Price, count)  576 non-null    int64
 3   (Price, sum)    576 non-null    float64
 4   (Age Range, )   576 non-null    object
dtypes: float64(1), int64(2), object(2)
memory usage: 22.6+ KB

                SN Age Price       Age Range
                       count   sum
0     Adairialis76  16     1  2.28     15-19
1      Adastirin33  35     1  4.48     30-34
2           Aeda94  17     1  4.91     15-19
3           Aela59  21     1  4.32     20-24
4        Aelaria33  23     1  1.79     20-24
..             ...  ..   ...   ...       ...
571     Yathecal82  20     3  6.22     15-19
572     Yathedeu43  22     2  6.02     20-24
573  Yoishirrala98  17     1  4.58     15-19
574     Zhisrisu83  10     2  7.89       <10
575      Zontibe81  21     3  8.03     20-24

[576 rows x 5 columns]

In [25]:
# Calculate and store age range counts
age_counts = purchases_grouped_df["Age Range"].value_counts()
age_counts

20-24    232
15-19    150
25-29     59
10-14     41
30-34     37
35-39     26
<10       24
40+        7
Name: Age Range, dtype: int64

In [26]:
# Calculate and store age range percentages
age_percentage = purchases_grouped_df["Age Range"].value_counts(normalize=True)
age_percentage

20-24    0.402778
15-19    0.260417
25-29    0.102431
10-14    0.071181
30-34    0.064236
35-39    0.045139
<10      0.041667
40+      0.012153
Name: Age Range, dtype: float64

In [27]:
# Create a new Data Frame containing age range counts and percentages
age_demo_df = pd.DataFrame({"Total count": age_counts,"Percentage of players": age_percentage}).round(2)
# Print the gender demographics Data Frame
age_demo_df
## How to sort rows correctly, as values contain symbols?

       Total count  Percentage of players
20-24          232                   0.40
15-19          150                   0.26
25-29           59                   0.10
10-14           41                   0.07
30-34           37                   0.06
35-39           26                   0.05
<10             24                   0.04
40+              7                   0.01

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [32]:
# Pivot table to obtain data grouped by age
age_grouped_df = pd.pivot_table(data=purchases_grouped_df,index=["SN","Age range"])
age_grouped_df = age_grouped_df.reset_index()
age_grouped_df.info()

/Users/abby/opt/anaconda3/envs/PythonDataEnviron/lib/python3.6/site-packages/ipykernel_launcher.py:2: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.

KeyError: 'Age range'

In [33]:
# Group and aggregate
purchasing_analysis_age_agg = purchases_grouped_df.groupby(["Age range"]).agg({"Price": ["count", "mean",sum]})
# Rename columns
purchasing_analysis_age_agg.columns=["Purchase count", "Average Purchase Price","Total Purchase Value"]
#Print Data Frame
purchasing_analysis_age_agg.round(2)

## These values are incorrect... something incorrect in the binning?

KeyError: 'Age range'

In [34]:
# Add a new column to the Data Frame for average total purchase per person i.e. total purchase value/purchase count

average_purchase_pp_age = purchasing_analysis_age_agg["Total Purchase Value"]/age_counts
purchasing_analysis_age_agg["Avg Total Purchase per Person"] = average_purchase_pp_age

# Print the purchasing analysis (age) Data Frame
purchasing_analysis_age_agg.round(2)

## These values are incorrect... something incorrect in the binning?

NameError: name 'purchasing_analysis_age_agg' is not defined

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [36]:
# Group data to see purchases by player, aggregated by price (count of purchases, average purchase price and total purchase value)
spending_df = purchases_df.groupby(["SN"]).agg({"Price": ["count", "mean",sum]})
spending_df = spending_df.reset_index()
spending_df.info()

## Again, issue with column names in brackets with commas...?

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   (SN, )          576 non-null    object
 1   (Price, count)  576 non-null    int64
 2   (Price, mean)   576 non-null    float64
 3   (Price, sum)    576 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 18.1+ KB

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [37]:
# Retrieve item ID, name and price
items_df = purchases_df[["Item ID","Item Name","Price"]]
items_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [38]:
# Group by item ID and item name, aggregate to obtain purchase count, item price and total purchase value

items_grouped_df = items_df.groupby(["Item ID","Item Name"]).agg({"Price": ["count","sum"]})
items_grouped_df = items_grouped_df.reset_index()
# items_grouped_df.info()
## Again, issue with column names in brackets with commas...? 

# Rename columns
items_grouped_df.columns=["Item ID", "Item Name","Purchase Count","Total Purchase Value"]

# Calculate and add column for purchase price (i.e. total purchase value/purchase count)
item_price = items_grouped_df["Total Purchase Value"]/items_grouped_df["Purchase Count"]
items_grouped_df["Item Price"] = item_price

# Sort data by purchase count, descending
items_grouped_df.sort_values(["Purchase Count"], ascending=False).round(2)

# Print preview of top 5
popular_items_df = items_grouped_df.sort_values(["Purchase Count"], ascending=False).round(2)
popular_items_df.head(5)

,Item ID,Item Name,Purchase Count,Total Purchase Value,Item Price
90,92,Final Critic,13,59.99,4.61
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,4.23
141,145,Fiery Glass Crusader,9,41.22,4.58
129,132,Persuasion,9,28.99,3.22
105,108,"Extraction, Quickblade Of Trembling Hands",9,31.77,3.53

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [39]:
# Sort data by total purchase value, descending
items_grouped_df.sort_values(["Total Purchase Value"], ascending=False).round(2)
# Print preview of top 5
profitable_items_df = items_grouped_df.sort_values(["Total Purchase Value"], ascending=False).round(2)
profitable_items_df.head(5)

,Item ID,Item Name,Purchase Count,Total Purchase Value,Item Price
90,92,Final Critic,13,59.99,4.61
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,4.23
80,82,Nirvana,9,44.10,4.90
141,145,Fiery Glass Crusader,9,41.22,4.58
100,103,Singed Scalpel,8,34.80,4.35